---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.LightingFixture
source: html/4a44c541-28f3-a6ff-68bc-cbbfa1e3978d.htm
---
# LightingFixture Members

Causes the object to release immediately any resources it may be utilizing.